## [13] Konversi Nilai Numerik ke Dalam Sejumlah Kategori

### [13.1] Import Module

In [2]:
import pandas as pd
import numpy as np
#mencetak versi pandas dan numpy yang akan digunakan
print(pd.__version__)
print(np.__version__)

1.0.5
1.18.5

### [13.2] Persiapan Data Frame
- membentuk data frame yang terdiri dari 10 baris dan 1 kolom 
- isi dari data frame adalah angka random yang dimulai dari 1 - 99

In [3]:
n_rows = 10
n_cols = 1
cols = ('usia',)

df = pd.DataFrame(np.random.randint(1,99,size=(n_rows,n_cols)),columns=cols)
df

   usia
0    55
1    67
2    83
3    52
4     6
5    41
6     2
7    53
8    32
9    32

### [13.3] Pengelompokan Nilai Numerik ke Dalam Beberapa Kategori Menggunakan Cut ()
Mengelompokkan usia sesuai dengan jangkauan umur :
1. Anak dengan usia 0-18 tahun
2. Dewasa dengan usia 18-65 tahun
3. Manula dengan usia 65-99 tahun

In [4]:
df ['kelompok_usia'] =  pd.cut(df['usia'],
                              bins = [0,18,65,99],
                              labels = ['anak','dewasa','manula'])
df

   usia kelompok_usia
0    55        dewasa
1    67        manula
2    83        manula
3    52        dewasa
4     6          anak
5    41        dewasa
6     2          anak
7    53        dewasa
8    32        dewasa
9    32        dewasa

## [14] Menggabungkan atau Merging Dua Pandas Data Frame

### [14.1] Import Module

In [5]:
import pandas as pd
import numpy as np
#mencetak versi pandas dan numpy yang akan digunakan
print(pd.__version__)
print(np.__version__)

1.0.5
1.18.5

### [14.2] Persiapan Data Frame
- Membentuk data frame dengan ukuran baris dan kolom 5 x 5 dengan isi data frame adalah integer random 1-20
- Untuk df1 merupakan salinan dari df akan tetapi baris 1 dan 4 dibuang
- Untuk df2 merupakan salinan dari df akan tetapi baris 0 dan 3 dibuang

In [6]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,20,size=(n_rows,n_cols)),columns=cols)
df

    A   B   C   D   E
0  11   1   1  19   7
1   4   1  16   2   5
2   3   5   7   2   3
3  17  19   2   8  17
4  18  13   8  12   2

In [7]:
df1 = df.copy(deep=True)
df1 = df1.drop([1,4])
df1

    A   B  C   D   E
0  11   1  1  19   7
2   3   5  7   2   3
3  17  19  2   8  17

In [8]:
df2 = df.copy(deep=True)
df2 = df.drop([0,3])
df2

    A   B   C   D  E
1   4   1  16   2  5
2   3   5   7   2  3
4  18  13   8  12  2

### [14.3] Menggabungkan Dua Data Frame
#### Penggabungan dua data frame bisa dilakukan dengan banyak cara, akan tetapi pembahasan kali ini akan berfokus kepada teknik inner dan outer
- Penggabungan dengan teknik inner akan menghasilkan baris yang dimiliki oleh kedua data frame dan indeks setelah di-merge dengan teknik inner akan ter-reset kembali ke nol
- Penggabungan dengan teknik outer akan menggabungkan baris dari kedua data frame dan akan menghilangkan duplikasi diantara kedua data di dataframe

In [9]:
df_inner = pd.merge(df1,df2,how='inner')
df_inner

   A  B  C  D  E
0  3  5  7  2  3

In [10]:
df_outer = pd.merge(df1,df2,how='outer')
df_outer

    A   B   C   D   E
0  11   1   1  19   7
1   3   5   7   2   3
2  17  19   2   8  17
3   4   1  16   2   5
4  18  13   8  12   2

## [15] Memecah Nilai String dari Suatu Kolom ke Dalam Beberapa Kolom Baru

### [15.1] Import Module

In [11]:
import pandas as pd
#mencetak versi pandas yang akan digunakan
print(pd.__version__)

1.0.5

### [15.2] Persiapan Data Frame

In [13]:
data = {'nama':['Didi Kempot','Glenn Fredly','Mbah Surip'],
       'tempat kelahiran':['Surakarta , Jawa Tengah','DKI Jakarta , Jakarta','Mojokerto , Jawa Timur']}
df = pd.DataFrame(data)
df

           nama         tempat kelahiran
0   Didi Kempot  Surakarta , Jawa Tengah
1  Glenn Fredly    DKI Jakarta , Jakarta
2    Mbah Surip   Mojokerto , Jawa Timur

### [15.2